# Используем образ Python в качестве базового образа
FROM python:3.11

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем зависимости проекта в контейнер
COPY requirements.txt .

# Устанавливаем зависимости проекта
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все содержимое текущей директории внутрь контейнера в /app
COPY . .

# Открываем порт, на котором будет работать FastAPI приложение
EXPOSE 8000

# Команда, которая будет запускать FastAPI приложение при старте контейнера
CMD ["python", "app/main.py"]
